---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElementWarning
source: html/ed3be1e0-1816-9614-c47c-94d125366ef5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.CannotKeepReferenceOfJoinedElementWarning Property

Can't keep reference of joined element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotKeepReferenceOfJoinedElementWarning { get; }
```